AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/eth_upload.cpp
static esp_err_t save_to_path(httpd_req_t *req, const char *path)
{
    const size_t MAX_SIZE = 512 * 1024;
    if (req->content_len == 0 || req->content_len > MAX_SIZE) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Bad size");
        return ESP_FAIL;
    }
    FILE *f = fopen(path, "wb");
    if (!f) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File open failed");
        return ESP_FAIL;
    }
    uint8_t buf[512];
    int remaining = (int)req->content_len;
    bool ok = true;
    while (remaining > 0) {
        int to_read = remaining < (int)sizeof(buf) ? remaining : (int)sizeof(buf);
        int received = httpd_req_recv(req, (char *)buf, to_read);
        if (received <= 0) { ok = false; break; }
        if (fwrite(buf, 1, received, f) != (size_t)received) { ok = false; break; }
        remaining -= received;
    }
    fclose(f);
    if (!ok) { remove(path); return ESP_FAIL; }
    return ESP_OK;
}

static esp_err_t post_upload_hd_handler(httpd_req_t *req)
{
    if (!is_authenticated(req)) return redirect_to_login(req);
    if (save_to_path(req, ETH_LOGO_HD_SPIFFS) != ESP_OK) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "HD upload failed");
        return ESP_FAIL;
    }
    ESP_LOGI(TAG, "logo_hd.jpg saved (%d bytes)", (int)req->content_len);
    httpd_resp_sendstr(req, "ok");
    return ESP_OK;
}

static esp_err_t post_upload_handler(httpd_req_t *req)
{
    if (!is_authenticated(req)) return redirect_to_login(req);
    const size_t MAX_SIZE = 512 * 1024;

    if (req->content_len == 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Empty file");
        return ESP_FAIL;
    }
    if (req->content_len > MAX_SIZE) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "File too large (max 512 KB)");
        return ESP_FAIL;
    }

    FILE *f = fopen(ETH_LOGO_SPIFFS, "wb");
    if (!f) {
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "File open failed");
        return ESP_FAIL;
    }

    uint8_t buf[512];
    int remaining = (int)req->content_len;
    bool ok = true;

    while (remaining > 0) {
        int to_read = (remaining < (int)sizeof(buf)) ? remaining : (int)sizeof(buf);
        int received = httpd_req_recv(req, (char *)buf, to_read);
        if (received <= 0) { ok = false; break; }
        if (fwrite(buf, 1, received, f) != (size_t)received) { ok = false; break; }
        remaining -= received;
    }
    fclose(f);

    if (!ok) {
        remove(ETH_LOGO_SPIFFS);
        httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Upload failed");
        return ESP_FAIL;
    }

    ESP_LOGI(TAG, "Logo saved (%d bytes). Restarting...", (int)req->content_len);
    httpd_resp_sendstr(req, "Logo uploaded! Restarting device...");
    vTaskDelay(pdMS_TO_TICKS(300));
    // Stop Ethernet DMA before reset — active EMAC DMA during SW_CPU_RESET
    // overwrites bootloader code in SRAM causing "Illegal instruction" crash.
    if (s_eth_handle) esp_eth_stop(s_eth_handle);
    vTaskDelay(pdMS_TO_TICKS(200));
    esp_restart();
    return ESP_OK;
}

// ── URL decode helper (for x-www-form-urlencoded bodies) ─────────────────────

static void url_decode(char *s)
{
    char *r = s, *w = s;
    while (*r) {
        if (*r == '%' && r[1] && r[2]) {
            char hex[3] = {r[1], r[2], '\0'};
            *w++ = (char)strtol(hex, NULL, 16);
            r += 3;
        } else if (*r == '+') {
            *w++ = ' '; r++;
        } else {
            *w++ = *r++;
        }
    }
    *w = '\0';
}

// ── MQTT config handlers ──────────────────────────────────────────────────────

static esp_err_t get_mqtt_info_handler(httpd_req_t *req)
{
    if (!is_authenticated(req)) return redirect_to_login(req);
    char host[64] = "";
    uint16_t port = 1883;
    {
        nvs_handle_t h;
        if (nvs_open("mqtt_cfg", NVS_READONLY, &h) == ESP_OK) {
            size_t len = sizeof(host);
            nvs_get_str(h, "host", host, &len);
            nvs_get_u16(h, "port", &port);
            nvs_close(h);
        }
    }
    const char *dev_id = wifi_mqtt_get_device_id();
    char prefix[52];
    snprintf(prefix, sizeof(prefix), "esp32_p4_86/%s", dev_id);
    char json[256];
    snprintf(json, sizeof(json),
             "{\"host\":\"%s\",\"port\":%d,\"device_id\":\"%s\",\"prefix\":\"%s\"}",
             host, (int)port, dev_id, prefix);
    httpd_resp_set_type(req, "application/json");
    return httpd_resp_sendstr(req, json);
}

static esp_err_t post_mqtt_cfg_handler(httpd_req_t *req)
{
    if (!is_authenticated(req)) return redirect_to_login(req);
    char body[128] = {};
    int len = httpd_req_recv(req, body, sizeof(body) - 1);
    if (len <= 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Empty body");
        return ESP_FAIL;
    }
    body[len] = '\0';

    char host[64] = "";
    uint16_t port = 1883;
    char *p = strstr(body, "host=");
    if (p) {
        strncpy(host, p + 5, sizeof(host) - 1);
        char *end = strchr(host, '&'); if (end) *end = '\0';
        // decode '+' as space (simple URL decode)
        for (char *c = host; *c; c++) if (*c == '+') *c = ' ';
    }
    p = strstr(body, "port=");
    if (p) { int v = atoi(p + 5); port = (v > 0 && v < 65536) ? (uint16_t)v : 1883; }

    nvs_handle_t h;
    if (nvs_open("mqtt_cfg", NVS_READWRITE, &h) == ESP_OK) {
        nvs_set_str(h, "host", host);
        nvs_set_u16(h, "port", port);
        nvs_commit(h);
        nvs_close(h);
        ESP_LOGI(TAG, "MQTT config saved: %s:%d", host, (int)port);
    }
    httpd_resp_sendstr(req, "MQTT config saved! Restart device to apply.");
    return ESP_OK;
}

// ── HA config handlers ────────────────────────────────────────────────────────

static esp_err_t get_ha_info_handler(httpd_req_t *req)
{
    if (!is_authenticated(req)) return redirect_to_login(req);
    char url[72] = "http://10.24.1.104:8123";
    nvs_handle_t h;
    if (nvs_open("ha_cfg", NVS_READONLY, &h) == ESP_OK) {
        size_t len = sizeof(url);
        nvs_get_str(h, "url", url, &len);
        nvs_close(h);
    }
    char json[128];
    snprintf(json, sizeof(json), "{\"url\":\"%s\"}", url);
    httpd_resp_set_type(req, "application/json");
    return httpd_resp_sendstr(req, json);
}

static esp_err_t post_ha_cfg_handler(httpd_req_t *req)
{
    if (!is_authenticated(req)) return redirect_to_login(req);
    char body[128] = {};
    int len = httpd_req_recv(req, body, sizeof(body) - 1);
    if (len <= 0) {
        httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Empty body");
        return ESP_FAIL;
    }
    body[len] = '\0';

    char url[72] = "";
    char *p = strstr(body, "url=");
    if (p) {
        strncpy(url, p + 4, sizeof(url) - 1);
        url_decode(url);
    }

    nvs_handle_t h;
    if (nvs_open("ha_cfg", NVS_READWRITE, &h) == ESP_OK) {
        nvs_set_str(h, "url", url);
        nvs_commit(h);
        nvs_close(h);
        ESP_LOGI(TAG, "HA config saved: %s", url);
    }
    httpd_resp_sendstr(req, "HA config saved! Restart device to apply.");
    return ESP_OK;
}

// ── Ethernet event handler ────────────────────────────────────────────────────

