AilurusFulgenss/iot-internship/week-02-esp32-basic/liv24-pio/src/eth_upload.cpp
static void eth_event_handler(void *arg, esp_event_base_t base,
                               int32_t id, void *data)
{
    if (base == ETH_EVENT) {
        if (id == ETHERNET_EVENT_CONNECTED)
            ESP_LOGI(TAG, "Ethernet link up");
        else if (id == ETHERNET_EVENT_DISCONNECTED)
            ESP_LOGW(TAG, "Ethernet link down");
    } else if (base == IP_EVENT && id == IP_EVENT_ETH_GOT_IP) {
        ip_event_got_ip_t *ev = (ip_event_got_ip_t *)data;
        char ip_str[48];
        snprintf(ip_str, sizeof(ip_str), "http://" IPSTR "/",
                 IP2STR(&ev->ip_info.ip));
        ESP_LOGI(TAG, "Got IP: %s", ip_str);

        // Override DHCP DNS with Google 8.8.8.8 so external hostnames resolve
        if (s_eth_netif) {
            esp_netif_dns_info_t dns = {};
            dns.ip.type = ESP_IPADDR_TYPE_V4;
            IP4_ADDR(&dns.ip.u_addr.ip4, 8, 8, 8, 8);
            esp_netif_set_dns_info(s_eth_netif, ESP_NETIF_DNS_MAIN, &dns);
            ESP_LOGI(TAG, "DNS overridden to 8.8.8.8");
        }

        if (bsp_display_lock(500)) {
            if (s_qr_obj) {
                lv_qrcode_update(s_qr_obj, ip_str, strlen(ip_str));
                lv_obj_clear_flag(s_qr_obj, LV_OBJ_FLAG_HIDDEN);
            }
            if (s_ip_label)
                lv_label_set_text(s_ip_label, ip_str);
            bsp_display_unlock();
        }
    }
}

// ── Shared Ethernet hardware init ────────────────────────────────────────────

static void eth_hw_start(esp_netif_t *eth_netif)
{
    // Power up IP101 PHY
    gpio_config_t pwr = {};
    pwr.pin_bit_mask = (1ULL << ETH_PHY_POWER_GPIO);
    pwr.mode         = GPIO_MODE_OUTPUT;
    ESP_ERROR_CHECK(gpio_config(&pwr));
    ESP_ERROR_CHECK(gpio_set_level((gpio_num_t)ETH_PHY_POWER_GPIO, 1));
    vTaskDelay(pdMS_TO_TICKS(150));

    // MAC — field-by-field init (ETH_ESP32_EMAC_DEFAULT_CONFIG() macro has wrong field
    // order for C++ designated initializers; values are identical to the P4 defaults).
    eth_esp32_emac_config_t emac_cfg = {};
    emac_cfg.smi_gpio.mdc_num  = 31;
    emac_cfg.smi_gpio.mdio_num = 52;
    emac_cfg.interface         = EMAC_DATA_INTERFACE_RMII;
    emac_cfg.clock_config.rmii.clock_mode = EMAC_CLK_EXT_IN;
    emac_cfg.clock_config.rmii.clock_gpio = (emac_rmii_clock_gpio_t)50;
    emac_cfg.dma_burst_len     = ETH_DMA_BURST_LEN_32;
    emac_cfg.intr_priority     = 0;
    emac_cfg.emac_dataif_gpio.rmii.tx_en_num  = 49;
    emac_cfg.emac_dataif_gpio.rmii.txd0_num   = 34;
    emac_cfg.emac_dataif_gpio.rmii.txd1_num   = 35;
    emac_cfg.emac_dataif_gpio.rmii.crs_dv_num = 28;
    emac_cfg.emac_dataif_gpio.rmii.rxd0_num   = 29;
    emac_cfg.emac_dataif_gpio.rmii.rxd1_num   = 30;
    emac_cfg.clock_config_out_in.rmii.clock_mode = EMAC_CLK_EXT_IN;
    emac_cfg.clock_config_out_in.rmii.clock_gpio = (emac_rmii_clock_gpio_t)-1;
    emac_cfg.mdc_freq_hz = 0;
    eth_mac_config_t mac_cfg = ETH_MAC_DEFAULT_CONFIG();
    eth_phy_config_t phy_cfg = ETH_PHY_DEFAULT_CONFIG();
    phy_cfg.phy_addr       = ETH_PHY_ADDR;
    phy_cfg.reset_gpio_num = -1;

    esp_eth_mac_t   *mac = esp_eth_mac_new_esp32(&emac_cfg, &mac_cfg);
    esp_eth_phy_t   *phy = esp_eth_phy_new_ip101(&phy_cfg);
    esp_eth_config_t eth_cfg = ETH_DEFAULT_CONFIG(mac, phy);
    ESP_ERROR_CHECK(esp_eth_driver_install(&eth_cfg, &s_eth_handle));
    ESP_ERROR_CHECK(esp_netif_attach(eth_netif, esp_eth_new_netif_glue(s_eth_handle)));
    ESP_ERROR_CHECK(esp_eth_start(s_eth_handle));
}

// ── HTTP config server (shared by background and upload-mode) ────────────────

static void start_http_server(void)
{
    httpd_handle_t server = NULL;
    httpd_config_t http_cfg = HTTPD_DEFAULT_CONFIG();
    http_cfg.stack_size       = 8192;
    http_cfg.max_uri_handlers = 11;

    if (httpd_start(&server, &http_cfg) != ESP_OK) {
        ESP_LOGE(TAG, "HTTP server start failed");
        return;
    }

    httpd_uri_t uri_login_get   = { "/login",       HTTP_GET,  get_login_handler,       NULL };
    httpd_uri_t uri_login_post  = { "/login",       HTTP_POST, post_login_handler,      NULL };
    httpd_uri_t uri_root        = { "/",            HTTP_GET,  get_root_handler,        NULL };
    httpd_uri_t uri_upload      = { "/upload",      HTTP_POST, post_upload_handler,     NULL };
    httpd_uri_t uri_upload_hd   = { "/upload_hd",   HTTP_POST, post_upload_hd_handler,  NULL };
    httpd_uri_t uri_mqtt_info   = { "/mqtt_info",   HTTP_GET,  get_mqtt_info_handler,   NULL };
    httpd_uri_t uri_mqtt_cfg    = { "/mqtt_cfg",    HTTP_POST, post_mqtt_cfg_handler,   NULL };
    httpd_uri_t uri_ha_info     = { "/ha_info",     HTTP_GET,  get_ha_info_handler,     NULL };
    httpd_uri_t uri_ha_cfg      = { "/ha_cfg",      HTTP_POST, post_ha_cfg_handler,     NULL };
    httpd_register_uri_handler(server, &uri_login_get);
    httpd_register_uri_handler(server, &uri_login_post);
    httpd_register_uri_handler(server, &uri_root);
    httpd_register_uri_handler(server, &uri_upload);
    httpd_register_uri_handler(server, &uri_upload_hd);
    httpd_register_uri_handler(server, &uri_mqtt_info);
    httpd_register_uri_handler(server, &uri_mqtt_cfg);
    httpd_register_uri_handler(server, &uri_ha_info);
    httpd_register_uri_handler(server, &uri_ha_cfg);
    ESP_LOGI(TAG, "HTTP server ready on port 80");
}

// ── Normal-mode Ethernet (MQTT background) ───────────────────────────────────

bool eth_logo_fetch_from_url(const char *url)
{
    ESP_LOGI(TAG, "Fetching logo from: %s", url);
    esp_http_client_config_t cfg = {};
    cfg.url         = url;
    cfg.timeout_ms  = 15000;
    cfg.buffer_size = 1024;

    esp_http_client_handle_t client = esp_http_client_init(&cfg);
    if (!client) return false;

    if (esp_http_client_open(client, 0) != ESP_OK) {
        esp_http_client_cleanup(client);
        return false;
    }

    int content_len = esp_http_client_fetch_headers(client);
    int status      = esp_http_client_get_status_code(client);
    ESP_LOGI(TAG, "Logo fetch: HTTP %d  len=%d", status, content_len);

